[
    {
      "title":"Personal Portfolio Website",
      "company":"Personal Project",
      "dates":"September 2018", 
      "description":"Personal Website hosted on github, URL: dannymaclean.com. Built on AngularJS framework.",
      "website":"http://dannymaclean.com/#/home"
    },
    {
      "title":"MetaGo",
      "company":"2018 Metaswitch Hackathon",
      "dates":"August 2018",
      "description":"Created a web application to simplify the item checkout process in the company cafeteria. Using an Angularjs front end, faces would be captured when an employee stood in front of the camera and then identified using a python backend. Items could then be identified and charged to a user’s account kept in a PostgreSQL database.",
      "website":"https://github.com/dannymaclean98/MetaGo"
    },
    {
      "title":"AccessionVQT",
      "company":"Metaswitch Intern Project",
      "dates":"Summer 2018",
      "description":"Developed a testing solution for VoIP quality analysis for Accession Mobile, a Metaswitch hosted PBX VoIP communication solution. The solution is being used to prevent regressions in voice quality for future software releases and to deduce areas to improve quality. Conducted signal analysis to determine perceptive audio quality and developed a GUI front end using Python.",
      "website":"https://github.com/dannymaclean98/AccessionVQT"
    },
    {
      "title":"The Lone Shooter",
      "company":"University of Texas at Austin Video Game Design Competition Honarblae Mention",
      "dates":"Fall 2017",
      "description":"Developed the software and hardware for a handheld video game. Employing C++ and Assembly, the application interfaced directly with hardware using drivers also written for the project. This included ADC logic for joystick movement, DAC for sound and sprite movement on an LCD screen.",
      "website":"https://github.com/dannymaclean98/TheLoneShooter"
    },
    {
      "title":"CountDown Solver",
      "company":"Python Learning Excercise",
      "dates":"Summer 2018",
      "description":"Automatic solver for the British Game Solver using an optimized DFS search.",
      "website":"https://github.com/dannymaclean98/CountDown"
    }
  ]
  